// aslan el malaf pta3 el usecases da fe el 8alep lma ted5ol feh ptlkay asamy malafat zay 
// addEmployee , DeleteEmployee , UpdataElSalary we hakza // fa pmgrd ma tefta7 el el folder da 
// pt3rf el tatpek py3mel eeeeh we da esmo el (Screaming Architecture)(الهيكلية اللي بتصرخ بوظيفتها).


// el class naso p2a ma3mol leeh ? 

// السبب الأول: مبدأ المسؤولية الواحدة (Single Responsibility) ☝️
// الريبوزيتوري: مخزن كبير فيه دوال كتير (هات، ضيف، احذف، عدل).

// الكيوبت: مدير الشاشة.

// لو الكيوبت كلم الريبوزيتوري مباشرة، الكيوبت هيبقى شايف كل دوال الريبوزيتوري (حتى اللي مش محتاجها).

// الـ UseCase: بيخلي الكيوبت يركز على "مهمة واحدة بس". الكيوبت عايز "العدد"؟ يبقى ينده على GetEmployeesCountUseCase. هو مش شايف غيرها، وده بيقلل الأخطاء والتعقيد.

// السبب الثاني: سهولة التعديل (Refactoring) 🛠️
// تخيل بكرة المدير طلب منك: "عايزك لما تجيب عدد الموظفين، تخصم منهم المتدربين، وتزود عليهم العمال المؤقتين".

// لو كنت بتنادي الريبوزيتوري في الكيوبت، كنت هتضطر تكتب اللوجيك (المعادلة الحسابية) جوه الكيوبت. ولو عندك 3 شاشات بيعرضوا العدد، هتكرر الكود 3 مرات.

// مع الـ UseCase: هتكتب المعادلة دي في ملف الـ UseCase ده بس. وأي حد بيناديه هياخد النتيجة المعدلة جاهزة.

// السبب الثالث: نظافة الكود في الـ Cubit 🧹
// الكيوبت وظيفته بس "إدارة الحالة" (State Management). مش وظيفته يعرف البيزنس لوجيك المعقد.

// بدون UseCase: الكيوبت هيبقى مليان كود حسابات واتصالات.

// مع UseCase: الكيوبت بيبقى "نضيف"، بيقول: "يا UseCase هات الرقم"، "شكراً"، "يا UI اعرض الرقم".

// 💡 تشبيه المطعم 🍽️
// الكيوبت (الويتر/الجرسون): وظيفته ياخد الطلب ويوصله.

// الريبوزيتوري (مدير المطبخ): يعرف يجيب أي حاجة من الثلاجة.

// الـ UseCase (عنصر في المنيو - مثلاً "برجر"):

// أنت لما تطلب، بتشاور على "برجر" (UseCase).

// مش بتروح لمدير المطبخ تقوله "هات عيش ولحمة وشويهم وحط صوص" (Repository Call).

// الـ UseCase هو "الوصفة الجاهزة" اللي بتسهل التعامل بين الويتر والمطبخ.

// الخلاصة: أنت عملت الملف ده عشان تحافظ على تطبيقك منظم، قابل للتطوير، وسهل القراءة. حتى لو كان سطر واحد دلوقتي، بكرة لما اللوجيك يكبر، الملف ده هو اللي هيشيل الشغل كله. 🚀

import 'package:dartz/dartz.dart';
import 'package:injectable/injectable.dart';
import 'package:smart_erp/core/errors/failures.dart';
import 'package:smart_erp/features/home/data/repositories/home_repository.dart';
// da 3ashan el git it y3raf en el class da mawgod we yghzo 3ashan lma el cubit tlpo 
// yp2a la tanas el cupit ptlop men el useCase 
@lazySingleton  
class GetEmployeesCountUseCase {
  final HomeRepository repository;

  // hena pya5od el reposty 3ashan ykdar ygep el 3add pta3 el employee de aslan mohmto pas hwa pykol eno
  // 3aez el repostry  3ashan ykdar y3mel kda 
  GetEmployeesCountUseCase(this.repository);


  Future<Either<Failure , int>> call()async{
    return await repository.getEmployeesCount();
  }
}